Autodesk.Revit.DB.AreaVolumeSettings.SetSpatialElementBoundaryLocation(Autodesk.Revit.DB.SpatialElementBoundaryLocation,Autodesk.Revit.DB.SpatialElementType)
Sets the spatial element boundary location of a spatial element type.
spatialElementBoundaryLocation:
The boundary location.
spType:
The spatial element type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Currently only SpatialElementType.Room is permitted when setting the boundary location.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.AreaVolumeSettings.GetSpatialElementBoundaryLocation(Autodesk.Revit.DB.SpatialElementType)
Gets the spatial element boundary location based on spatial element type.
spType:
The spatial element type.
Returns:
The boundary location.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.AreaVolumeSettings.GetAreaVolumeSettings(Autodesk.Revit.DB.Document)
Get the area and volume settings of the project.
aDoc:
The document.
Returns:
The area and volume settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.AreaVolumeSettings.ComputeVolumes
True to enable volume computation.  False to disable it.
Remarks:
When this setting is False, rooms and spaces will be treated as simple extrusions of their 2d boundaries.
The volume parameter will report "not computed".
When this setting is True, the geometry of rooms and spaces will be trimmed
when it intersects elements such as ceilings, roofs, and floors.
Since:
2014

Autodesk.Revit.DB.AreaVolumeSettings
This class provides access to settings related to volume and area computations.
Since:
2014